<?php
$translate = array(
	'weekday'=> array(//день недели
		1=>'Воскресенье',
		2=>'Понедельник',
		3=>'Вторник',
		4=>'Среда',
		5=>'Четверг',
		6=>'Пятница',
		7=>'Суббота',
		),
	'tod' => array(//время суток
		0=>'ночью',
		1=>'утром',
		2=>'днем',
		3=>'вечером',
		),
	'phenomena_cloudiness'=>array(//облачность по градациям
		'ясно',
		'малооблачно',
		'облачно',
		'пасмурно',
		),
	'phenomena_precipitation'=>array(//тип осадков
		4=>'дождь',
		5=>'ливень',
		6=>'снег',
		7=>'снег',
		8=>'гроза',
		9=>'-',
		10=>'без осадков',
		),
	'phenomena_rpower'=>array(//интенсивность осадков, если есть
		0=>'возможен дождь-снег',
		1=>'дождь/снег',
		),
	'phenomena_spower'=>array(//вероятность грозы, если прогнозируется
		0=>'возможна гроза',
		1=>'гроза',
		),
	'wind_direction'=>array(//направление ветра в румбах, 0 - северный, 1 - северо-восточный,  и т.д.
		0=>'северный',
		1=>'северо-восточный',
		2=>'восточный',
		3=>'юго-восточный',
		4=>'южный',
		5=>'юго-западный',
		6=>'западный',
		7=>'северо-западный',
		),
);

$months = array(
	1=>'января',
	2=>'февраля',
	3=>'марта',
	4=>'апреля',
	5=>'мая',
	6=>'июня',
	7=>'июля',
	8=>'августа',
	9=>'сентября',
	10=>'октября',
	11=>'ноября',
	12=>'декабря',
);
?>
