<?php
/*
* Украинская локализация для программы "Сниппет информера Gismeteo" 
* Страница программы: http://dayte2.com/?act=state&num=176
* Автор перевода: Даниил Орос
* Сайты: http://oros.kiev.ua http://danio.kiev.ua
* E-mail: admin@oros.kiev.ua
* Дата перевода: 14.04.2011
*/
$translate = array(
	'weekday'=> array(//день тижня
		1 => 'Неділя',
		2 => 'Понеділок',
		3 => 'Вівторок',
		4 => 'Середа',
		5 => 'Четвер',
		6 => 'П\'ятниця',
		7 => 'Субота',
		),
	'tod' => array(//час доби
		0 => 'вночі',
		1 => 'вранці',
		2 => 'вдень',
		3 => 'ввечері',
		),
	'phenomena_cloudiness'=>array(//хмарність по градаціях
		'ясно',
		'малохмарно',
		'хмарно',
		'похмуро',
		),
	'phenomena_precipitation'=>array(//тип опадів
		4=>'дощ',
		5=>'злива',
		6=>'сніг',
		7=>'сніг',
		8=>'гроза',
		9=>'-',
		10=>'без опадів',
		),
	'phenomena_rpower'=>array(//інтенсивність опадів, якщо є
		0 => 'можливий дощ / сніг',
		1 => 'дощ / сніг',
		),
	'phenomena_spower'=>array(//ймовірність грози, якщо прогнозується
		0 => 'можлива гроза',
		1 => 'гроза',
		),
	'wind_direction'=>array(//напрям вітру в румбах, 0 - північний, 1 - північно-східний, і т.д.
		0 => 'північний',
		1 => 'північно-східний',
		2 => 'східний',
		3 => 'південно-східний',
		4 => 'південний',
		5 => 'південно-західний',
		6 => 'західний',
		7 => 'північно-західний',
		),
	);

$months = array(
		1 => 'січня',
		2 => 'лютого',
		3 => 'березня',
		4 => 'квітня',
		5 => 'травня',
		6 => 'червня',
		7 => 'липня',
		8 => 'серпня',
		9 => 'вересня',
		10 => 'жовтня',
		11 => 'листопада',
		12 => 'грудня',
);
?>
